In [11]:
#series

import pandas as pd

temp = pd.Series([-20, -10, 10, 20], index = ['Jan', 'Feb', 'Mar', 'Apr'])

temp

Jan   -20
Feb   -10
Mar    10
Apr    20
dtype: int64

In [26]:
#Data Frame
import pandas as pd


data = {
    'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
}

#df stands for data frame
df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'], columns = ['name', 'Uni'])

df

               name     Uni
Student1  Rhodamine  Kyushu
Student2        Ted   Seoul
Student3      Hines   Tokyo

In [20]:
#index

#Data Frame
import pandas as pd


data = {
    'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
}

#df stands for data frame
df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'])

#reset
# df.index.name = 'students information'
# df.reset_index()

#reset and get rid of previous index
# df.index.name = 'students information'
# df.reset_index(drop=True, inplace=True)

#setting uni as the index
#inplace = setting those data as real data
# df.set_index('Uni', inplace=True)
# df

#sorting

df.set_index('Uni', inplace=True)
df.sort_index()

                  Conpany       name
Uni
Kyushu          LGinnotek  Rhodamine
Seoul   Samsung Electrics        Ted
Tokyo           SK hynics      Hines

In [13]:
#File reading and writting

#writting
# import pandas as pd

# data = {
#     'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
# }

# df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'])

# df.to_csv('information.csv')

#reading

import pandas as pd

df = pd.read_excel('OS_test_sorter.xlsx', skiprows = 1, nrows = 10)

#df.head()
#df.tail(3)
#df['Unnamed: 2'].nlargest(3)

In [22]:
#data selecting

import pandas as pd

df = pd.read_excel('OS_test_sorter.xlsx', skiprows = 1, nrows = 10)

df[df.columns[-1]][0:5]

0    0.234
1    0.234
2    0.234
3    0.234
4      NaN
Name: Unnamed: 2, dtype: float64

In [43]:
#loc

import pandas as pd

df = pd.read_excel('OS_test_sorter.xlsx', index_col='OS1')
#df.loc['D0N']
df.loc['OS2':'OS3']

     Unnamed: 1
OS1
OS2         NaN
D0N       0.234
D0P       0.234
D1N       0.234
D1P       0.234
NaN         NaN
OS3         NaN